app/controllers/home_controller.rb

    def index
        @messages = Message.all
---
SELECT "messages".* FROM "messages"