app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Ash"], ["LIMIT", 1]]
---
    def create
        user = User.find_by(username: params[:session][:username])